<?php

namespace App\Handlers;


// 中文内容的生成
class TextHandler
{
	protected $text = '我与妻子吻别，将长枪靠在肩上，加入了其他人的行列，离开了村庄。晨曦初照，斜穿过茂密的土库古尔森林，我们一行六人沿着一条破旧的土路走向哨站。我们轻装简行，因为我们这班哨岗只站到下个月，然后就会有另一队长枪兵接替我们。土库古尔与诺克萨斯接壤，而他们最近愈发强烈的好战性已经让领主大人们紧张起来，要求手下的所有长矛都尖锐锋利。

我们的旅途短暂而又平淡，这是士兵的梦想。半日路程的后段，我们看到了哨站升起的烟火信号，一柱淡淡的烽火白烟欢迎着我们的到来。同伴们的心情很轻松，闲聊着自己好兄弟和邻居的事。虽然我们的职责是在边疆寻找战争的迹象，但战争对于土库古尔来说还是个很陌生的概念。

到达以后，我们发现营寨围栏的大门敞开，也没有安放任何阻隔，但却没有暴力破坏的痕迹。一种奇怪的感觉油然而生，一股寒意在我们所有人的后脊梁上跳动着。我能在其他人身上看得到的寒意，与我自己感受到的一样真实。

我们组成了小盾墙阵，三人一排，前后两排推进营寨，我们以为会看到一片狼藉——破败与毁灭，诺克萨斯的迹象。

但什么迹象都没有。

我们眼前的景象和任何哨站都没什么两样。薪柴燃尽只剩下余烬，柴堆上的炊具里盛满了食物。挂起来的衣服还没晾干，昨夜的灯笼还留在柱子上。我们警觉地交换眼神，面面相觑。似乎我们的同袍是直接消失了的。

“这里怎么能变成这样的？”贝尔小声说道。我们的盾墙拉成一条直线，然后四散开来在哨站里搜索生命的迹象。

“他们是不是被俘虏了？”奥赖克问道。

我靠近营寨的内壁。一条木料被烧灼得比沥青还黑。我伸出手，指尖刚刚碰到焦木，就碎裂成了粉末，露出一环平滑的木坑。其他人也在营寨各处发现了类似的痕迹，但没人能猜得透这些痕迹是如何留下的。

一声吼叫让我们立刻摆好战斗的蹲姿。“快来！”

是亚弗恩的声音。我们立刻跑向他的位置，他正站在一具尸体旁边。

“是豪赖恩”他看着我们说。“皮匠家的孩子。”

地上的年轻人肤色惨白，像婴儿一样蜷缩在那里。我们没有在他身上看到任何战斗的痕迹，没有血，也没有伤口。

我抽出小刀。蹲了下来，将刀身放在豪赖恩的鼻子下。天很冷，浅薄的呼吸在钢刃上留下的霜气映出了缓慢、僵硬的节奏。

“他还活着，”我一边说，一边伸手扶起他的肩膀。我刚把他扶到仰卧位，我们所有人立刻都跳开了。

豪赖恩睁开了双眼，但眼中空无一物。在我们看来，他还存在意识，但他的右眼死死盯着天空，黯淡无光。

这不是我们跳开的原因。

“天神在上，”奥莱克惊呼道。亚弗恩吐了一滩口水辟邪，我们也都效仿他。

豪赖恩原本左眼的地方只剩下了一个黑洞洞的坑。我这辈子见过许多次战斗，也知道刀枪剑戟留下的痕迹，但绝我所知没什么武器能留下这样的伤口。这个洞太圆、太光滑，绝不符合战斗的狂乱。年轻人的脸上也没有因伤而来的痛苦表情。

“什么东西能把他弄成这样？”贝尔不解地问道。“野兽？还是瘟疫？”

想到这里我们不禁又后退了一步。“不，”开尔皱起眉头，一只手下意识地摸了摸挂在腰间装着药草和药膏的袋子。“没有化脓的迹象。这不是疾病。”

“找到其他人，”贝尔命令道。“抓紧。”

我们一个接一个找到了他们。这些都是我们认识的人，来自我们的村庄，有渔夫也有铁匠。所有人左眼都带着同样的伤，全都溃散成同样的精神状态。他们看上去十分安详，而也正因如此显得愈发恐怖。

亚弗恩看了看贝尔。“我们怎么办？”

“我们必须发出警告，”奥莱克说。

“警告人们什么？”开尔问。“我们都不知道这里发生了什么。”

他们争吵起来。他们的声音碰撞重叠。但在所有声音之上，我注意到空气中出现一股烟的味道。

“等等。”

其他人停了下来，回头看向我。我咽了一下口水。

“如果他们都已经这样了，”我指了指身后的烟火信号，“那是谁点燃的烽——”

我们谁也没反应过来发生了什么，只见奥莱克飞到了半空中。一道耀眼的闪光让我什么都看不见，但我瞥到闪光中映出一个巨大的黑影。空气中充斥着战友们吐出的誓言、祈祷和咒骂。但随着一记如同长鞭抽打的爆裂声响，他们的声音全都静止了，接踵而至的是一声令人胆战心惊的尖叫。

当我再次能看得见的时候，我发现自己在地上。

我低下头看到自己双腿摊开，已经残破。其他的战士们，我的兄弟和朋友们，都在盯着头上的天空。

我只能听到一个人的声音，于是转过头去。我眼睁睁地看着刚满十六岁的亚弗恩在那怪物下面挣扎。他沐浴在惨烈的紫光之下，它的一条肢体埋入他的眼睛，深入他的透露。他的尖叫停止了，成为和其他人一样的驱壳。

然后那个怪物将恶毒的凝视投向我的方向。

一瞬间，它已笼罩在我上方。我抬头看到了那只膨隆的独眼，感受到一股超越想象的饥饿。这种饥饿并非渴求血肉，而是某种更深层的东西。我的灵魂在这样一个深远的边缘摇摇欲坠，而它无情的饥饿正在拖拽着我。

不。

我是汉尼斯·凯达恩，我是一名战士，是土库古尔的长枪。我拒绝让它如愿以偿地得到我的惨叫，即便它的触手已经刺入我的眼睛。我没有感到疼痛——

——因为这是我的工作。分析的过程也是可以造成肉体上的痛苦的，只要我愿意，但此处并非关键。我已经学会了许多疼痛，以及疼痛的用法。

该对象的信息很珍贵，正如所有知识都同样珍贵。一处定居点，相互关联，城堡。一个特别的雌性个体，以及后代……该对象拒绝我对该部分内容的分析，但这个问题很容易克服。

没有其他可以食用的了，我来到了这里，来散播我所收集到的。

我下面的深谷是一根导管，用于将信息传送给真实领域。这个世界里栖息的生物将我们的领域命名为虚空。这些实体所编制的诗意是如此奇妙——这奇妙的诗意也恰恰说明了我的任务距离完成还有多远。

我周围的宇宙充满了知识、力量和遥远的土地，我要把它们全部收集。现在，我献出这些信息，未来，我将献出剩下的全部。

接收。

吞噬。

学习。';
	private function ch2arr($str)
	{
    	$length = mb_strlen($str, 'utf-8');
    	$array = [];
    	for ($i=0; $i<$length; $i++)  
        	$array[] = mb_substr($str, $i, 1, 'utf-8');    
    	return $array;
}

	private function asArray() {
		$oldchar = [" ","　","\t","\n","\r","，","。","！","？","“","”","、","…"];
		$text = str_replace($oldchar,'',$this->text);
		return $this->ch2arr($text);
	}

	private function content($length) {
		$array = $this->asArray();
		$text = null;
		$total = count($array);
		$total--;
		$len = $length;
		if(is_array($length)) {
			$len = rand($length[0],$length[1]);
		}
		for($i=0;$i<=$len;$i++) {
			$text .= $array[rand(0,$total)];
		}
		return $text;
	}
	public function name($length = null){
		if(! $length) $length = rand(3,8);
		return $this->content($length);
	}
	// 返回句子
	public function juzi($length = null) {
		if(! $length) $length = rand(3,25);
		return $this->content($length);
	}
	// 返回文本
	public function text($length = null) {
		if( ! $length) {
			$length = rand(300,1000);
		}
		return $this->content($length);
	}

}